{"class_name": "Model", "config": {"name": "model", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 300], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 300], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "lstm_layer", "class_name": "LSTM", "config": {"name": "lstm_layer", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 50, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "truncated_normal", "seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "unit_forget_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["input_1", 0, 0, {}]], [["input_2", 0, 0, {}]]]}, {"name": "L1_distance", "class_name": "Lambda", "config": {"name": "L1_distance", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxoAAABkAXQAagF8AGQCGQB8AGQBGQAYAIMBGABTACkDTukB\nAAAA6QAAAAApAtoBS9oDYWJzKQHaAXipAHIGAAAA+jQvaG9tZS9qZXNzaWNhL1NpYW1lc2UtU2Vu\ndGVuY2UtU2ltaWxhcml0eS9zaWFtZXNlLnB52gg8bGFtYmRhPjIAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "siamese", "output_shape": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwgAAAB8AGQBGQBTACkCTukAAAAAqQApAdoBeHICAAAAcgIA\nAAD6NC9ob21lL2plc3NpY2EvU2lhbWVzZS1TZW50ZW5jZS1TaW1pbGFyaXR5L3NpYW1lc2UucHna\nCDxsYW1iZGE+MwAAAPMAAAAA\n", null, null], "output_shape_type": "lambda", "output_shape_module": "siamese", "arguments": {}}, "inbound_nodes": [[["lstm_layer", 0, 0, {}], ["lstm_layer", 1, 0, {}]]]}, {"name": "Similarity_layer", "class_name": "Dense", "config": {"name": "Similarity_layer", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["L1_distance", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["Similarity_layer", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}